themes/backend_theme/views/manufactures/index.php

                      return implode(', ', $sections);;
                },
                'filterType'=>GridView::FILTER_SELECT2,
                'filter'=>ArrayHelper::map(Specialized::find()->orderBy('name')->asArray()->all(), 'SpID', 'name'),
---
SELECT * FROM `specialized` ORDER BY `name`

                      return $model->getTagNames();
                },
                'filterType'=>GridView::FILTER_SELECT2,
                'filter'=>ArrayHelper::map(Tags::find()->orderBy('name')->asArray()->all(), 'name', 'name'),
---
SELECT * FROM `tags` ORDER BY `name`