themes/backend_theme/views/categories/index.php

            'filter' => Categories::getCategoriesForDropdown(),
            'attribute' => 'parent_ID',
            'value'=>function ($model, $key, $index, $widget) {
                $cat = Categories::findOne($model->parent_ID);
---
SELECT * FROM `categories` WHERE `CID`=25