frontend/controllers/LuminaireController.php

    public function actionView($cat)
    {
        $request = Yii::$app->request;

        Url::remember();
        $model = Categories::findOne($cat);
---
SELECT * FROM `categories` WHERE `CID`='3'