frontend/controllers/SiteController.php

    public function actionPage($id="homepage",$params = array()) {
        if(is_numeric($id)) {
            $page = Pages::findOne($id);
        } else {
            $page = Pages::find()->where(['slug'=>$id])->one();
---
SELECT * FROM `pages` WHERE `slug`='homepage'