themes/backend_theme/views/products/index.php

                          return implode(', ', $sections);;
                    },
                    'filterType'=>GridView::FILTER_SELECT2,
                    'filter'=>ArrayHelper::map(Categories::find()->orderBy('name')->asArray()->all(), 'CID', 'name'),
---
SELECT * FROM `categories` ORDER BY `name`

                        }
                    },
                    'filterType'=>GridView::FILTER_SELECT2,
                    'filter'=>ArrayHelper::map(Manufactures::find()->orderBy('name')->asArray()->all(), 'MID', 'name'),
---
SELECT * FROM `manufactures` ORDER BY `name`

                          return implode(', ', $sections);;
                    },
                    'filterType'=>GridView::FILTER_SELECT2,
                    'filter'=>ArrayHelper::map(Sizes::find()->orderBy('name')->asArray()->all(), 'SID', 'name'),
---
SELECT * FROM `sizes` ORDER BY `name`

                          return implode(', ', $sections);;
                    },
                    'filterType'=>GridView::FILTER_SELECT2,
                    'filter'=>ArrayHelper::map(Finishes::find()->orderBy('name')->asArray()->all(), 'FID', 'name'),
---
SELECT * FROM `finishes` ORDER BY `name`