themes/frontend_theme/views/luminaire/_product-info-popup.php

SELECT * FROM `manufactures` WHERE `MID`=10
---
                <p class="wishlist-popup-madeby">Made by:</p>
                <p class="wishlist-popup-product-name">
                    <?php
                    $manuf = Manufactures::findOne($model['manufacture_id']);

SELECT * FROM `product_sizes` WHERE `PID`=1019
---
                <p><?=$model->description?></p>
                <div class="wishlist-popup-sizes-wrapper">
                    <?php
                    $product_sizes = ProductSizes::find()->where(['PID'=>$model->PID])->all();

SELECT * FROM `sizes` WHERE `SID`=466
---
                        <h3>Sizes:</h3>
                        <?php
                        foreach($product_sizes as $product_size) {
                            $ps = Sizes::findOne($product_size->SID);

SELECT * FROM `product_finishes` WHERE `PID`=1019
---
                    ?>

                    <?php
                    $product_finishes = ProductFinishes::find()->where(['PID'=>$model->PID])->all();

SELECT * FROM `finishes` WHERE `FID`=15
---
                        <h3>Finishes:</h3>
                        <?php
                        foreach($product_finishes as $product_finish) {
                            $pf = Finishes::findOne($product_finish->FID);