themes/frontend_theme/views/luminaire/index.php

SELECT * FROM `pages` WHERE `slug`='luminaire/index'
---
    <?=$this->render("//general_partial/_sidebar-ls")?>
    <div class="luminaire-content main-content-of-page luminaire-selector-content ajax-content">
        <?php
        $page = Pages::find()->Where(['slug'=>'luminaire/index'])->one();