backend/models/Categories.php

    public static function getCategoriesList($parent=0) {
        $return = [];
//        $categories = Categories::find()->where(['parent_id' => $parent,'status'=>'1'])->orderBy('name ASC')->all();
        $query = Categories::find();
        $query->where(['parent_ID' => $parent,'status'=>'1']);
        $query->orderBy('order_id ASC');

        $categories = $query->all();
---
SELECT * FROM `categories` WHERE (`parent_ID`=25) AND (`status`='1') ORDER BY `CID`

    public function getParentCategoryTreeArray($cid) {
        $model = Categories::findOne($cid);
---
SELECT * FROM `categories` WHERE `CID`=3

    public function getCategoriesForDropdown() {
        $query = Categories::find();
        $query->andWhere("`status` = '1'");
        $query->orderBy('`name` ASC');

        $res = $query->all();
---
SELECT * FROM `categories` WHERE `status` = '1' ORDER BY `name`