backend/models/ImportCsv.php

SELECT * FROM `categories` WHERE `CID`=25
---

                }
            }elseif($this->table == 'Categories'){
                $cat = Categories::findOne($rowData[0][$columns['CID']]);