backend/models/Pages.php

SELECT * FROM `sliders` WHERE `SliderID`='1'
---
    public function processShortcode($matches) {
        // parse out the arguments

        $regex = '/(\w+)\s*=\s*["|\'](.*?)["|\']/';
        preg_match_all($regex,$matches[2],$attributes);
        $params = array();
        if(count($attributes) > 0) {
            foreach($attributes[1] as $i => $v) {
                $params[$v] = $attributes[2][$i];
            }
        }

        switch($matches[1]){
            case "slider":
//                return print_r($params,true);
                if(isset($params['id'])) {
                    $slider = Sliders::findOne($params['id']);