backend/models/Specialized.php

SELECT * FROM `specialized` WHERE `status`=1 ORDER BY `name`
---
    public function createSpecializedTree() {
        $models = Specialized::find()->where(['status'=>1])->orderBy("name ASC")->all();